---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectFloorPlane
source: html/d794367c-07b4-b665-fea8-6b1eb1993958.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectFloorPlane Property

"Vertical Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalProjectFloorPlane { get; }
```